//TODO:============task-3======================================================
// У нас є об'єкт, у якому зберігатимуться зарплати
// нашої команди
// Напишіть код для сумування всіх зарплат і
// збережіть його результат у змінній sum.
// Якщо об'єкт salaries порожній, то результат має бути 0

// це об'єкт
const salaries = {
  tolia: 1500,
  anton: 3000,
  taras: 4000,
};

// задаємо змінну (let - можна змінити. const - не можна змінити) яка буде повертати результат сумування всіх зарплат
let sumSalries = 0;

// Є ДВА ВАРІАНТИ ВІРІШЕННЯ
// 1 варіан. запускаємо цикл перебір об'єкта (for in - призначенний для перебору об'єкта), (де const key - тут буде записуватись кожна ітерація (tolia, anton, taras), in salaries - що ми будемо перебирати в нашому випадку це об'єкт (salaries)
for (const key in salaries) {
  // тут запускаємо умову: якщо об'єкт(salaries) має(.hasOwnProperty) ключи((key)) ==>
  if (salaries.hasOwnProperty(key)) {
    //  ==> то в такому випадку кожне значення(1500 300 4000) ключа складай в сумму (+= salaries[key] - це є звернення до ключа в такому випадку буде повертати значення (1500 +  +3000 +4000 = 8500)) плюсуй і додавай до змінноі (sumSalries)
    sumSalries += salaries[key];
    // якщо тут записати console.log(sumSalries) то буде видавати не сумму всіх чисел а сумму кожноі ітерації, так як змінна константа let sumSalries записанна в глобальній видимості
  }
}
// тому вивід результату прописуємо в глобальній видимості
console.log(sumSalries);

// 2 варіант.
// задаємо змінну МАСИВА яка буде зберігати значення ключів(1500 3000 4000)
const arrayValues = Object.values(salaries);
// запускаємо цикл перебір МАСИВА (for of - призначенний для перебору МАСИВА), (де const number  - тут буде записуватись кожна ітерація (1500, 3000, 4000), of arrayValues - що ми будемо перебирати в нашому випадку це МАСИВ (arrayValues)
for (const number of arrayValues) {
  //  ==> тут ми прописуемо склади(1500 3000 4000) в сумму (+= number - це є звернення до значення масива в такому випадку буде повертати значення (1500 +  +3000 +4000 = 8500)) плюсуй і додавай до змінноі (sumSalries)
  sumSalries += number;
}
// тому вивід результату прописуємо в глобальній видимості
console.log(sumSalries);
